# ReadAccessLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..ReadAccessLevel Property
Schema Class See Also
---
Read access level of the schema.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AccessLevel ReadAccessLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReadAccessLevel As AccessLevel
	Get
```

Visual C++
---
```text
public:
property AccessLevel ReadAccessLevel {
	AccessLevel get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace